

### 1) Import Pandas

In [1]:
import pandas as pd

### 2) Import the dataset and  Assign it to a variable called users and use the 'user_id' as index

#### Import the dataset from this url (../../dataset/assign1/basic_data_analysis.csv).

In [2]:
users = pd.read_csv('../../dataset/assign1/basic_data_analysis.csv',sep='|',index_col='user_id')

### 3) Display the first 6 entries

In [4]:
users.head(6)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213
6         42      M   executive    98101

### 4) Display the last 4 entries

In [5]:
users.tail(4)

         age gender     occupation zip_code
user_id
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### 5) What is the number of observations in the dataset?

In [9]:
users.shape[0]
#len(users.index) #or this

943

### 6) What is the number of columns in the dataset, also print the name of all the columns?

In [13]:
print('no of columns: ',len(users.columns))
print(users.columns)

no of columns:  4
Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 7) What is the data type of each column?

In [29]:
print(users.dtypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 8) Print only the occupation column

In [22]:
users['occupation'][:5]

user_id
1    technician
2         other
3        writer
4    technician
5         other
Name: occupation, dtype: object

### 9) How many different occupations are in this dataset?

In [90]:
print(len(users['occupation'].value_counts()))
#or
print(users['occupation'].describe().loc['unique'])

21
21

### 10) What is the most frequent occupation?

In [50]:
print(users['occupation'].value_counts(sort=True,ascending=False).index[0] )#or .value_counts().index[0]
#or
print(users.occupation.mode())

student
0    student
dtype: object

### 11) Summarize the DataFrame.

In [61]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### 12) Summarize only the occupation column

In [62]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 13) What is the mean age of users?

In [69]:
users['age'].mean()

34.05196182396607

### 14) What is the age with least occurrence?

In [77]:
users['age'].value_counts().index[-1]

7